---
kind: enumMember
id: F:Autodesk.Revit.DB.DirectShapeReferencingOption.NotReferenceable
enum: Autodesk.Revit.DB.DirectShapeReferencingOption
source: html/6c3c17c6-8b68-27da-aba4-cf62da3ec58c.htm
---
# Autodesk.Revit.DB.DirectShapeReferencingOption.NotReferenceable

The associated DirectShape shall not be referenceable.